package mahjong.game.util;

/**
 * @author muyi
 * @description:
 * @date 2020-11-10 20:02:49
 */
public class MahjongConstant {

    public static final String GUOBIAO = "guobiao";
    public static final String GUANGDONG = "guangdong";
    public static final String SICHUAN = "sichuan";

    public static final String HU = "HU";
    public static final String PENG = "PENG";
    public static final String GANG = "GANG";
    public static final String CHI = "CHI";

    /**
     * 国标麻将
     */
    public static final String[] GUOBIAO_PAI = {
            "无效", "无效", "无效", "无效", "无效", "无效", "无效", "无效", "无效", "无效",
            "无效", "一萬", "二萬", "三萬", "四萬", "五萬", "六萬", "七萬", "八萬", "九萬",
            "无效", "一条", "二条", "三条", "四条", "五条", "六条", "七条", "八条", "九条",
            "无效", "一筒", "二筒", "三筒", "四筒", "五筒", "六筒", "七筒", "八筒", "九筒",
            "无效", "東风", "无效", "南风", "无效", "西风", "无效", "北风", "无效", "无效",
            "无效", "红中", "无效", "發财", "无效", "白板", "无效", "无效", "无效", "无效",
            "无效", "春", "夏", "秋", "冬", "梅", "兰", "竹", "菊", "无效"};

    /**
     * 国标麻将所以有效牌的数字码
     */
    public static final int[] GUOBIAO_PAI_CODE = {
            // 一到九万
            11, 12, 13, 14, 15, 16, 17, 18, 19,
            // 一到九条
            21, 22, 23, 24, 25, 26, 27, 28, 29,
            // 一到九筒
            31, 32, 33, 34, 35, 36, 37, 38, 39,
            // 东南西北
            41, 43, 45, 47,
            // 中发白
            51, 53, 55,
            // 春夏秋冬       梅兰竹菊
            61, 62, 63, 64, 65, 66, 67, 67, 68};

    /**
     * 广东麻将
     */
    public static final String[] GUANGDONG_PAI = {
            "无效", "无效", "无效", "无效", "无效", "无效", "无效", "无效", "无效", "无效",
            "无效", "一萬", "二萬", "三萬", "四萬", "五萬", "六萬", "七萬", "八萬", "九萬",
            "无效", "一条", "二条", "三条", "四条", "五条", "六条", "七条", "八条", "九条",
            "无效", "一筒", "二筒", "三筒", "四筒", "五筒", "六筒", "七筒", "八筒", "九筒",
            "无效", "東风", "无效", "南风", "无效", "西风", "无效", "北风", "无效", "无效",
            "无效", "红中", "无效", "發财", "无效", "白板"};

    /**
     * 广东麻将所以有效牌的数字码
     */
    public static final int[] GUANGDONG_PAI_CODE = {
            // 一到九万
            11, 12, 13, 14, 15, 16, 17, 18, 19,
            // 一到九条
            21, 22, 23, 24, 25, 26, 27, 28, 29,
            // 一到九筒
            31, 32, 33, 34, 35, 36, 37, 38, 39,
            //东南西北
            41, 43, 45, 47,
            // 中发白
            51, 53, 55};

    /**
     * 四川麻将
     */
    public static final String[] SICHUAN_PAI = {
            "无效", "无效", "无效", "无效", "无效", "无效", "无效", "无效", "无效", "无效",
            "无效", "一萬", "二萬", "三萬", "四萬", "五萬", "六萬", "七萬", "八萬", "九萬",
            "无效", "一条", "二条", "三条", "四条", "五条", "六条", "七条", "八条", "九条",
            "无效", "一筒", "二筒", "三筒", "四筒", "五筒", "六筒", "七筒", "八筒", "九筒"};

    /**
     * 四川麻将所以有效牌的数字码
     */
    public static final int[] SICHUAN_PAI_CODE = {
            // 一到九万
            11, 12, 13, 14, 15, 16, 17, 18, 19,
            // 一到九条
            21, 22, 23, 24, 25, 26, 27, 28, 29,
            // 一到九筒
            31, 32, 33, 34, 35, 36, 37, 38, 39};

}
